/**
 * คำสั่งว่างเปล่าไม่ได้ใช้งาน
*/
const content = function () { return; }
/**
 * คลาสข้อผิดพลาด จากสาเหตุที่ระบุไม่ได้
*/
content.UNKNOWN = 0;
/**
 * คลาสข้อผิดพลาด จากสาเหตุที่ไม่ได้ระบุ
*/
content.UNSPECIFIED = 1;
/**
 * คลางข้อผิดพลาด จากสาเหตุทางด้านเครือข่าย
*/
content.NETWORK = 2;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบไม่สามารถประมวลข้อมูลได้
 * เนื่องจากชุดข้อมูลดังกล่าวไม่เป็นข้อมูล JSON ถูกต้องหรือสมบูรณ์
*/
content.BAD_JSON = 3;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบไม่สามารถประมวลข้อมูลได้
 * เนื่องจากชุดข้อมูลดังกล่าวไม่ถูกต้องหรือสมบูรณ์
*/
content.BAD_DATA = 4;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบไม่พบข้อมูล
*/
content.NOT_FOUND = 5;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบไม่พร้อมใช้งาน
*/
content.NOT_AVAILABLE = 6;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบยังไม่มีตรรกะในการทำงาน
*/
content.NOT_IMPLEMENTED = 7;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบยังไม่สามารถยืนยันตัวตนได้
*/
content.NOT_AUTHORIZED = 8;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบปฎิเสธคำร้องเนื่องสิทธิ์เข้าถึง
*/
content.FORBIDDEN = 9;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบพบข้อมูลซ้ำกัน
*/
content.DUPLICATE = 10;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบพบข้อมูลซ้ำซ้อนกัน
*/
content.CONFLICT = 11;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบปฎิเสธการทำงานเนื่องจากข้อจำกัด
*/
content.CONSTRAINT = 12;
/**
 * คลาสข้อผิดพลาด ในกรณีที่ระบบปฎิเสธการทำงานเนื่องจากคำสั่งไม่ถูกต้อง
*/
content.COMMAND = 13;
/**
 * รายการข้อผิดพลาดทั้งหมดที่ใช้โดยทั่วไป
*/
export default content;
